" Caroline Christmas, a control freak desires nothing more than a perfect Christmas with her sisters at her lavish country manor to atone for the fact that their father abandoned them many years ago. When on Christmas Eve their long-lost father arrives at their doorstep with his new girlfriend, chaos ensues. Through a series of mishaps and misunderstandings, Caroline uncovers a long-buried family secret. Can the family still celebrate Christmas together after all? Tired of scaring humans every October 31 with the same old bag of tricks, Jack Skellington, the spindly king of Halloween Town, kidnaps Santa Claus and plans to deliver shrunken heads and other ghoulish gifts to children on Christmas morning. But as Christmas approaches, Jack's rag-doll girlfriend, Sally, tries to foil his misguided plans. Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption. It is an adaptation of the Charles Dickens classic A Christmas Carol, featuring Scrooge McDuck as his namesake and inspiration Ebenezer Scrooge and Mickey Mouse as Bob Cratchit. This film was based on a 1972 audio musical entitled Disney's A Christmas Carol. It is a twenty-four minute animated short film produced by Walt Disney Productions as an accompaniment to a re-release of The Rescuers. Inside a snowflake exists the magical land of Whoville. In Whoville, live the Whos, an almost mutated sort of Munchkin-like people. All the Whos love Christmas, yet just outside of their beloved Whoville lives the Grinch. The Grinch is a nasty creature that hates Christmas, and plots to steal it away from the Whos, whom he equally abhors. Yet a small child, Cindy Lou Who, decides to try befriending the Grinch. A determined Angela makes a wish to reunite her family in time for Christmas, then launches a plan to find her way from Ireland to Australia. Kate Pierce is reluctantly spending Christmas with her mom’s new boyfriend and his son Jack. But when the North Pole and Christmas are threatened to be destroyed, Kate and Jack are unexpectedly pulled into a new adventure with Santa Claus. Kate is a young woman who has a habit of making bad decisions, and her last date with disaster occurs after she accepts work as Santa's elf for a department store. However, after she meets Tom there, her life takes a new turn. Each Christmas, Santa and his vast army of highly trained elves produce gifts and distribute them around the world in one night. However, when one of 600 million children to receive a gift from Santa on Christmas Eve is missed, it is deemed ‘acceptable’ to all but one—Arthur. Arthur Claus is Santa’s misfit son who executes an unauthorised rookie mission to get the last present half way around the globe before dawn on Christmas morning. Siblings Kate and Teddy try to prove Santa Claus is real, but when they accidentally cause his sleigh to crash, they have to save Christmas. When Santa crash-lands in the junkyard on Christmas Eve, Hank, Trash Truck and their animal friends all have a hand in rescuing the holiday for everyone. Two talented song-and-dance men team up after the war to become one of the hottest acts in show business. In time they befriend and become romantically involved with the beautiful Haynes sisters who comprise a sister act. After getting blamed for spoiling Christmas, the richest kid in the world wishes he'd never been born. Unfortunately, a wishing machine, invented by professor Keenbean, picked up the wish and made it come true. Now Richie finds himself in a parallel world where his only hope is to find professor Keenbean and the wishing machine so he can wish things back to normal. Written by Peter Huiskes A real estate developer is given the opportunity of his career to transform an old shopping complex into a prime location. Unfortunately, there is one tenant who is holding out—the Christmas shop owner he met by happenstance just days ago. When Nicky finds an unopened Christmas card from a high school secret admirer, she and her best friend Simone search to find and thank the anonymous author. When a reporter goes undercover as a nanny to get the inside scoop on a playboy prince, she gets tangled in some royal intrigue and ends up finding love - but will she be able to keep up her lie? Kaley, a young Au Pair, finds herself unable to return home for the holidays when a snowstorm derails her plans. In spite of her own disappointment she is determined to teach the girls she watches, alongside their charming Uncle, the magic of Christmas. Will this series of events lead to a perfect Christmas? On Christmas Eve, Kelly is reluctant to go to a Christmas Eve ball, so Barbie tells her the story of Eden Starling, a glamourous singing diva in the Victorian England and the owner of a theatre house. However, Eden is self-centred and loves only herself. She is frequently accompanied by her snooty cat, Chuzzlewit. She does not believe in Christmas and orders all her employees to work on Christmas. An escaped maniac returns to his childhood home on Christmas Eve, which is now a sorority house, and begins to murder the sorority sisters one by one. A trip to church with her family on Christmas Eve gives young Angela an extraordinary idea. A heartwarming tale based on a story by Frank McCourt. When the eternally optimistic Poppy, queen of the Trolls, learns that the Bergens no longer have any holidays on their calendar, she enlists the help of Branch and the rest of the gang on a delightfully quirky mission to fix something that the Bergens don't think is broken. Mr. Bean wins a trip to Cannes where he unwittingly separates a young boy from his father and must help the two reunite. On the way he discovers France, bicycling and true love, among other things. Two women, one from the United States and one from the United Kingdom, swap homes at Christmastime after bad breakups with their boyfriends. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship. After she's diagnosed with a terminal illness, a shy woman decides to take a European vacation. Gaby Jones, fashion photographer, takes a holiday retreat against her desire by advise of her friend. She will then find that there's more behind a photo when she meets wildlife photographer Sean. 8-year-old Finn is terrified to learn his family is relocating from sunny California to Maine in the scariest house he has ever seen! Convinced that his new house is haunted, Finn sets up a series of elaborate traps to catch the “ghost” in action. Left home alone with his sister while their parents are stranded across town, Finn’s traps catch a new target – a group of thieves who have targeted Finn’s house. Overwhelmed by her suffocating schedule, touring European princess Ann takes off for a night while in Rome. When a sedative she took from her doctor kicks in, however, she falls asleep on a park bench and is found by an American reporter, Joe Bradley, who takes her back to his apartment for safety. At work the next morning, Joe finds out Ann's regal identity and bets his editor he can get exclusive interview with her, but romance soon gets in the way. Business executive Jazmin Carter is known for two things: turning fledgling businesses into profit producers and avoiding Christmas in Harlem, the neighborhood where she grew up. The Winter Feast is Po's favorite holiday. Every year he and his father hang decorations, cook together, and serve noodle soup to the villagers. But this year Shifu informs Po that as Dragon Warrior, it is his duty to host the formal Winter Feast at the Jade Palace. Po is caught between his obligations as the Dragon Warrior and his family traditions: between Shifu and Mr. Ping. After his sudden firing, a popular radio DJ moves in with his aunt, bringing along his four spoiled children, and a plan to return to the airwaves. A fateful meeting with a mysterious stranger inspires Pee-wee Herman to take his first-ever holiday. Snowfall marks the start of Odinyule — the Viking holiday of giving! But crazy weather might cancel the tradition unless the Rescue Riders can swoop in. A talented photographer stuck in a dead-end job inherits an antique Advent calendar that may be predicting the future -- and pointing her toward love. As her friends prep for a Life Day holiday celebration, Rey journeys with BB-8 on a quest to gain a deeper knowledge of the Force at a mysterious Jedi Temple. There, she embarks on a cross-timeline adventure through beloved moments in Star Wars history, coming into contact with iconic heroes and villains from all eras of the saga. But will she make it back in time for the Life Day feast? Johnny Case, a freethinking financier, has finally found the girl of his dreams — Julia Seton, the spoiled daughter of a socially prominent millionaire — and she's agreed to marry him. But when Johnny plans a holiday for the two to enjoy life while they are still young, his fiancée has other plans & that is for Johnny to work in her father's bank! Lovely Linda Mason has crooner Jim Hardy head over heels, but suave stepper Ted Hanover wants her for his new dance partner after femme fatale Lila Dixon gives him the brush. Jim's supper club—Holiday Inn—is the setting for the chase by Hanover and manager Danny Reed. The music's the thing. Sascha, the young and beautiful trophy girlfriend of a Danish drug lord, arrives at his holiday villa in the seaside town of Bodrum, on the Turkish Riviera, where she is welcomed into his inner circle. Under the summer sun, she lives a carefree dream of luxury and fun until she meets Tomas, a Dutch traveler trying to discover himself. When Anna offers a stranded mother and son shelter in a blizzard, she learns that they are the Royal Family of Galwick. Anna shows the Prince how they do Christmas in her hometown, encouraging him to open his heart and be true to himself. Billie Holiday spent much of her career being adored by fans. In the 1940's, the government targeted Holiday in a growing effort to racialize the war on drugs, ultimately aiming to stop her from singing her controversial ballad, \"Strange Fruit.\" A ne er-do-well thirty-something attempts to appease her family by kidnapping herself an attractive boyfriend for the family Christmas. Despite unlikely odds and dysfunctional family moments, the two fall in love and share a magical Christmas. Hawthorne College is quieting down for the holidays. One by one, sorority girls on campus are being killed by an unknown stalker. But the killer is about to discover that this generation's young women aren't willing to become hapless victims as they mount a fight to the finish. Luther Krank is fed up with the commerciality of Christmas; he decides to skip the holiday and go on a vacation with his wife instead. But when his daughter decides at the last minute to come home, he must put together a holiday celebration. When Vanessa receives the results from her Family Tree DNA test, she discovers a family she didn't know existed and travels to their home for Christmas. To inherit her father's company, socialite Ellen must first visit his small hometown, where she learns the value of hard work and helping others. Boyd Mitchler and his family must spend Christmas with his estranged family of misfits. Upon realizing that he left all his son's gifts at home, he hits the road with his dad in an attempt to make the 8-hour round trip before sunrise. An old bitter miser who makes excuses for his uncaring nature learns real compassion when three ghosts visit him on Christmas Eve. Nia Moore ia a successful small-town real estate agent trying to sell a resort to her client, Julian. Much to Nia's dismay, the only resort that Julian wants to buy belongs to her widower father, Patrick. Patrick is ready to retire, but Nia wants to keep the property and the family memories it holds. When a reservation mix-up at a mountain resort forces a newly-single travel writer to share a cabin with a handsome widower and his precocious daughter over the holidays, their lives are transformed by the magic of Christmas and the unexpected power of love. Amy, Kiki and Carla – three under-appreciated and over-burdened women – rebel against the challenges and expectations of the Super Bowl for mothers: Christmas. And if creating a more perfect holiday for their families wasn’t hard enough, they have to do all of that while hosting and entertaining their own mothers. An imaginary world comes to life in a holiday tale of an eccentric toymaker, his adventurous granddaughter, and a magical invention that has the power to change their lives forever. Santa Claus, Mickey Mouse and all his Disney pals star in an original movie about the importance of opening your heart to the true spirit of Christmas. Stubborn old Donald tries in vain to resist the joys of the season, and Mickey and Pluto learn a great lesson about the power of friendship. Angie wonders what her life would be like if she had married a former boyfriend who became a famous sportscaster. She takes the train home to spend Christmas with her family and inexplicably finds herself 10 years in the past. With the advice of the train's enigmatic conductor, Angie has the chance to revisit that Christmas and learn what — and who — is truly important to her. Join Barbie and her sisters Skipper, Stacie and Chelsea as their holiday vacation plans turn into a most unexpected adventure and heartwarming lesson. After a snowstorm diverts their plane, the girls find themselves far from their New York destination and their holiday dreams. Now stranded at a remote inn in the tiny town of Tannenbaum, the sisters are welcomed by new friends and magical experiences. In appreciation for the wonderful hospitality they receive, they use their musical talents to put on a performance for the whole town. Barbie and her sisters realize the joy of being together is what really makes A Perfect Christmas! Walter Meyer (Danny Glover) is a retired mechanic who lost the love of his life one year earlier. Now that the holiday season is here, he invites daughters Rachel (Gabrielle Union) and Cheryl (Kimberly Elise) and sons Christian (Romany Malco) and Evan (Jessie T. Usher) to his house for a traditional celebration. Poor Walter soon realizes that if his bickering children and the rest of the family can spend five days together under the same roof, it will truly be a Christmas miracle. Heidi, who initially left her small town of Pleasant Valley with the dream of one day becoming a successful painter, has put her own art on hold to excel as an art gallery curator. Now, a week before the gallery’s big Christmas party, she must return home to watch her niece and nephew. She comes face to face with her high school love, Chris, now a teacher, and offers to help him find a new last-minute location for the Christmas dance. A medieval English knight is magically transported to present day where he ends up falling for a high school science teacher. It's Christmastime, and the Griswolds are preparing for a family seasonal celebration. But things never run smoothly for Clark, his wife Ellen, and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going, knowing that his Christmas bonus is due soon. A Christmas elf accidentally takes off in Santa's sleigh, crash lands in a small town, and loses the magic toy bag. Beethoven must rescue the elf, recover the bag from greedy crooks, and return the sleigh to Santa in time to save Christmas. Four Italian men are suddenly involved in awkward situations, while they are spending the Christmas holiday, stuck in Amsterdam. A big-city sommelier, Camila returns to her hometown and family-run business for the annual ice wine harvest that coincides with the holidays. But the visit is upended when the owner of the vineyard—her beloved godfather—announces they’ve hired a consultant named Declan Monroe to oversee the switch from old world methods to modern technology. A professional in the advertising business, Holly dreams of finding Mr. Right, & getting the \"perfect\" romance. When she meets someone who ~looks the part, she falls hard & fast. But soon she is reminded that appearances can be deceiving, & true love grows in more unexpected places. Thirty-something Hillary Burns has spent her life trying to get the approval of her parents, most specifically her judgmental mother, Meredith Burns, thus far without success. Part of that approval for Hillary is to marry the right man. That's why Hillary is so happy that she is engaged to successful lawyer Jason King, who she will bring home to meet the family for the first time at their Thanksgiving get-together weekend in a week's time. However, Hillary's life starts to fall apart when simultaneously she loses her part-time newspaper writing job when the newspaper itself folds, and Jason dumps her as he tries to focus on his career which is seemingly more important to him than Hillary. On the advice of her best friend Sophie, Hillary - who feels she can't go home without Jason, especially as her two sisters' lives seem to meet their mother's approval - decides... When her husband abruptly ends their marriage, empty nester Kate embarks on a solo second honeymoon in Africa, finding purpose and potential romance. When college friends reunite after 15 years over the Christmas holidays, they discover just how easy it is for long-forgotten rivalries and romances to be reignited. Sisters Alex and Madison are whisked away to the Bahamas for winter break but soon find themselves crossing paths with a man smuggling stolen artifacts. Luke Skywalker and Han Solo battle evil Imperial forces to help Chewbacca reach his imperiled family on the Wookiee planet - in time for Life Day, their most important day of the year! Four mini-movie escapades starring the Minions, with various special guest appearances, all to celebrate the holidays! After losing his police officer lover, Christian drag queen Holiday Heart  meets 12-year-old Niki and her drug-addicted mother, Wanda. Heart finds relief from heartache and a renewed sense of purpose when he steps in as a father figure to Niki and welcomes the two women into his life. But when Wanda becomes romantically involved with her drug dealer, Silas, it may endanger Niki and threaten to destroy the makeshift family. The Fix-It Force makes a plan to hit every home as fast as they can, delivering Blunderberry Cakes before the town awakes to avoid a holiday disaster. When Brooke’s boyfriend, Ethan, breaks up with her just before the holidays, she agrees to go home with Joel, an actor who will pose as her boyfriend. Just before Christmas, department store clerk Steve Mason meets big spending customer Connie Ennis, who's actually a comparison shopper sent by another store. Steve lets her go, which gets him fired. They spend the afternoon together, which doesn't sit well with Connie's steady suitor, Carl, when he finds out, but delights her young son Timmy, who quickly takes to Steve. Doug and Abi  and their three children travel to the Scottish Highlands for Doug's father Gordie's birthday party. It's soon clear that when it comes to keeping a secret under wraps from the rest of the family, their children are their biggest liability... A hopeless romantic is cursed with relationship problems after her chauvinistic father mistreats the wrong woman. A shy high school student's Christmas wish comes true only it isn't exactly as wonderful as she'd hoped. Jennifer and Meg Swift are two sisters who are very close despite living far apart. Jennifer is in Salt Lake City, running a successful restaurant she started with her late husband and raising her teenaged son Simon, Meg stayed in their hometown of Hazelwood, helping their parents run the local bakery. A week before Christmas, Paula finds herself struggling with bills and life with her blue-collar husband Gary and her two daughters. When Nick, her high school boyfriend returns to town, a wealthy art gallery owner, Paula wonders if she made the wrong decision when she took the wrong date to the prom. What would her life have been like if she stayed with Nick? Rebecca must throw the company holiday party with office rival, Chris. It coincides with Hanukkah, so she must juggle her work, family traditions, and nemesis to make the party a success. The film follows Chinese American Suzie who draws on her family’s cultural traditions to spice up an old-fashioned Christmas baking competition. Suzie, a rising young architect, returns to her small hometown in Maine for Christmas where her Chinese American family runs the local Lobster Bar. Following the loss of her beloved grandmother who was a renowned baker in their community, Suzie is guilted into following in her grandmother’s footsteps bei entering the local gingerbread house competition. Teaming up with an old high school friend Billy, who grew up to be catch, Suzie must find the right recipes and mix of sugar and spice to win the competition and perhaps find some love in the process. 1960s musical showcasing Cliff Richard. Four bus mechanics working for London Transport strike up a deal with the company: they do up a one of the company's legendary red double decker buses and take it to southern Europe as a mobile hotel. If it succeeds, they will be put in charge of a whole fleet. While on the road in France they pick up three young British ladies whose car breaks down and offer to take them to their next singing job in Athens. They also pick up a stowaway, who hides the fact that she's a famous American pop star on the run, chased by the media and her parents. Don't be fooled by the title. Christmas Holiday is a far, far cry from It's a Wonderful Life. Told in flashback, the story begins as Abigail Martin marries Southern aristocrat Robert Monette. Unfortunately, Robert has inherited his family's streak of violence and instability, and soon drags Abigail into a life of misery. The comic mishaps and adventures of a young boy named Ralph, trying to convince his parents, teachers, and Santa that a Red Ryder B.B. gun really is the perfect Christmas gift for the 1940s. Kat is an aspiring singer-songwriter who dreams of making it big. However, her dreams are stalled by her reality: a conniving and cruel stepfamily  and a demoralizing job working as a singing elf at billionaire Terrence Wintergarden’s Santa Land. Plankton, Mr. Krabs' nemesis, vows to get his Christmas wish - obtaining the Krusty Krab's secret Krabby Patty formula - by turning everyone bad in Bikini Bottom with the help of his special jerktonium-laced fruitcake. Step brothers Drake and Josh must give a foster family the best Christmas ever or face years in jail for a Christmas party gone wrong. Drew Latham is an executive leading an empty, shallow life with only wealth on his side. Facing another lonely Christmas ahead, he revisit his old childhood home in the hope of reliving some old holiday memories – but he finds that the house in which he was raised is no longer the home in which he grew up. Wedding Planner, Kelsey Wilson, is about to have her big break: planning her beloved cousin's lavish and exclusive wedding. Everything is going smoothly until Connor McClane, a devilishly handsome private investigator, shows up and turns Kelsey's world upside-down. Hired by a secret source, Connor quickly disrupts the upcoming nuptials but wins Kelsey's heart in the process. Brooke Bennett goes to Ireland for Christmas to search for her Irish roots. While there, she meets Aiden Hart, Earl of Glaslough. Mistaken for an elite event planner, she’s hired to host his castle’s epic Christmas party. Teddy Duncan's middle-class family embarks on a road trip from their home in Denver to visit Mrs. Duncans Parents, the Blankenhoopers, in Palm Springs. When they find themselves stranded between Denver and Utah, they try to hitch a ride to Las Vegas with a seemingly normal older couple in a station wagon from Roswell, New Mexico. It turns out that the couple believes they are the victims of alien abduction. The Duncan's must resort to purchasing a clunker Yugo to get to Utah, have their luggage stolen in Las Vegas, and survive a zany Christmas with Grandpa and Grandma Blankenhooper. This year Christmas with the Whitfields promises to be one they will never forget. All the siblings have come home for the first time in years and they've brought plenty of baggage with them. As the Christmas tree is trimmed and the lights are hung, secrets are revealed and family bonds are tested. As their lives converge, they join together and help each other discover the true meaning of family. After opening a 100-year-old time capsule and finding her grandfather’s old journal, Lou questions whether she should move to New York after Christmas to further her writing career or stay in Pine Grove to carry on her family’s local newspaper. Charming chef, Kyle, is also at a crossroads, visiting Pine Grove for the holidays. When Carol Vanstone, CEO of the technology company Zenotek, expresses her intention to close the Chicago branch, run by her brother Clay, he and his co-workers organize a Christmas party in an effort to impress a potential client and save their jobs. But the party gets out of control… Susan is a newspaper staffer who decides to generate some Christmas spirit by writing an article about her family’s storied 100-year-old, hand-carved, heirloom Christmas angel. This leads her to accidentally meet Brady, a cute, upbeat artist who insists that he and Susan become fast friends (at least). It turns out that this angel also has the spiritual power to bring people together – as it seems to be doing with Susan and Brady. What’s behind this enchanted ornament? As time moves on, more about this captivating artifact is revealed. Jules has just inherited a quaint magical Christmas-themed village and Christmas tree farm bequeathed her by her grandmother. She plans to sell it and use the profits to buy her dream home in New York City. But the longer Jules stays on the farm and the more she learns how important Christmas Land has been to so many families, the more Jules starts to question her motives to sell. Bitter and hateful, the Grinch is irritated at the thought of a nearby village having a happy time celebrating Christmas. Disguised as Santa Claus, with his dog made to look like a reindeer, he decides to raid the village to steal all the Christmas things. When Sid accidentally destroys Manny's heirloom Christmas rock and ends up on Santa's naughty list, he leads a hilarious quest to the North Pole to make things right and ends up making things much worse. Now it's up to Manny and his prehistoric posse to band together and save Christmas for the entire world! London, 1843. Ebenezer Scrooge, a bitter old man, despises the Christmas holiday. Over the course of Christmas Eve night he is visited by three ghosts to show him his past, present and future. Deck the halls with Donkey’s laughter in this all-new holiday collection. Donkey presents his very own carolling stage show featuring his Far Far Away pals in this merry, musical treat with all the trimmings! Join in the fun as they bring their own Shrektacular spirit to festive holiday songs, a fun Donkey Decoration scramble, and a hilarious virtual Yule Log that’s so funny… it’s on fire. Scrooge is a miserly old businessman in 1840s London. One Christmas Eve he is visited by the ghost of Marley, his dead business partner. Marley foretells that Scrooge will be visited by three spirits, each of whom will attempt to show Scrooge the error of his ways. Will Scrooge reform his ways in time to celebrate Christmas? After her sister and brother-in-law's tragic death, an American woman who is the guardian for her young niece and nephew is invited to a royal European castle for Christmas by her late brother-in-law's father, the Duke of Castlebury. Feeling out of place as a commoner, she is determined to give her family a merry Christmas and surprises herself when she falls for a handsome prince. Classic Charles Dickens holiday tale of Ebenezer Scrooge, the miser's miser who has a huge change of heart after spirits whisk him into the past, present, and future. Blake and his mother Roxy live in Charlotte, NC. Roxy owns a dance studio and Blake is looking forward to a career as a fighter. Two men are hired to protect a man who is fleeing a drug syndicate. The initial meeting turns into chaos and with a dead body, briefcase of stolen money and an assassin on their tail, Nick and Derek are going to have to do more than just protect - they are going to have to kill. While planning an annual Christmas party, Peyton is forced together with Ben to care for a friend's daughter. While finding their Christmas spirit, will there be some romance along the way? Recently separated parents Tracie (Fisk) and Rick (Rogers) spend every other holiday with their young daughters Harper and Ava. But this Christmas, the girls have only one thing on their wish lists — to spend Christmas with both Mom and Dad at Tracie’s family farmhouse. The temporary reunion will be no walk in the park for Tracie and Rick, but perhaps this Christmas gathering can help rekindle the lost romance between the two and make their daughters’ greatest wish come true. Laughter, love and just a hint of magic make for THE PERFECT HOLIDAY, a fun-filled comedy romance starring Morris Chestnut, Gabrielle Union, Charlie Murphy, Katt Williams, Faizon Love, Terrence Howard and Queen Latifah. All Nancy Taylor (Union) wants for Christmas is to meet a nice man. So when her little girl shares Mommy's wish with smitten shopping mall Santa, Benjamin Armstrong (Chestnut), he does his best to make her dream come true in this delightful holiday treat the entire family will enjoy! All Mitch Snider wants for his family is a traditional holiday feast with the relatives. The problem is that he doesn't have any. That is until he gets an invitation in the mail from his long-lost cousin Woodrow. What follows is a full-course meal of nonstop laughs when the neurotic suburbanites clash with the hippy hicks from hell in National Lampoon's most outrageous family misadventure yet. Due to a female passenger falling out of her top whilst running for the bus Stan is distracted and crashes the bus resulting in the depot managers car being written off. As a result Stan, Jack and Blakey are fired. Stan and Jack soon get new jobs as a bus crew at a Pontins holiday resort but discover that Blakey has also gotten a job there as the chief security guard. A 1930s British summer Bank Holiday starts at midday on Saturday with a rush for the trains to the seaside. Doreen and Milly are off to a beauty contest, Geoffrey and Catherine are having an illicit weekend in the Grand Hotel and May and the kids are set for a more straightforward holiday of sea, sand, and pub. Meanwhile, the manager and performers on the pier are praying for rain. Mickey, Donald, Goofy, and Pluto experience all that Hawaii has to offer. Donald tries hula dancing, Pluto explores the beach and Goofy takes up surfing! Nickelodeon stars feature in vignettes and musical numbers about holiday custom's, all within a larger wrap-around story, Danni Hartford, party planner to the King family, wants to find her sister. Britney, the Kings' spoiled 15-year-old daughter, wants a horse. On a nearby horse farm, Rachel is treated like a servant by her foster siblings; all she wants is a real family. When all three girls make wishes at the Christmas dance, Britney and Rachel's souls switch bodies. But the girls soon find their new lives are not exactly what they pictured. When Danni discovers what has happened, she must figure out how to switch the girls back. When an actual, honest-to-goodness royal princess runs off from her official obligations and duties for a couple of days to see how the other half lives, she winds up falling for a good Samaritan who is unaware of her real identity during the holiday season. Will her true love still feel the same way once he learns the truth? Polar opposites meet and fall in love, but it isn't long before their relationship is on the rocks. In order to get through the holiday season without too much drama they decide to pretend they are still a couple, but their plan takes an unexpected turn. Ashley Scott plays an executive for a company that produces pet supplies. Just after getting into a fight with her boyfriend about their relationship status, she takes up with the company's mascot and the company president's son on a road trip across America at Christmastime in an effort to get home for the holiday season. George Bird is a salesman of agricultural machinery who finds out that he hasn't long to live. On his doctor's advice, he goes to an exclusive seaside resort to spend his savings on one last holiday. Pediatrician by day, single mom by night, SARAH invites her estranged husband, PETE, back to their suburban home for the Holidays on one condition: he must reconcile with their daughters before she agrees to finalize a trial separation with divorce. When Sadie's (Malone Thomas) boyfriend cancels their holiday plans, she decides to spend Christmas with her parents back in her hometown, only to find out they've sold the family's beloved chocolate store to a stranger who knows nothing about chocolate. Begrudgingly, her father convinces her that she'd be the obvious choice to help teach the new owner everything she knows about chocolate. In the middle of planning the perfect retirement party for her parents, she discovers that not everything has to be perfect. And sometimes, when you least expect it, you find love. Taraji P. Henson, Golden Globe-winning star of EMPIRE and the movie “Hidden Figures,” is back this holiday season to spread cheer, goodwill and some holiday magic in this third annual music and variety special. Hannah is a book editor and she must work with her former rival Ryan to help a potential writer find her way. However, life seems to have other plans for Hannah as Angel Anthony reminds the duo about the miracle of Christmas and the value of community. Rod and Katherine Wright are enjoying their retirement in Florida – or so they’re telling each other. Actually, Rod’s been bored with nothing to do, and Katherine misses her kids back home, especially with Christmas right around the corner. At least they’ve made friends with their new neighbor Lisa, who’s a golden retriever fan like them – Rod and Katherine’s dog Jake has three new puppy playmates, Mario, Luigi and Pasquale. But when Jake and the puppies take off during a walk with Lisa and interrupt a wedding proposal, Lisa is mortified to discover the proposer is none other than her lifelong-friend-turned-boyfriend-turned-ex, David. Everyone can see that David and Lisa are meant to be together. Everyone, that is, except for David and Lisa. Now, with David’s wedding approaching, they must decide whether to leave their love in the past, or to give it another chance. With a little help from Rod and Katherine and four lovable pups, it’s sure to be a Christmas to remember. While gathering evidence to support closing a tropical U.S. Air Force base, a congressional aide warms to its generous captain. With his carefree lifestyle on the line, a wealthy charmer poses as a ranch hand to get a hardworking farmer to sell her family’s land before Christmas. Theodora, a time consumed professional crosses paths with Charlie, a writer, when she travels to his hometown for business just before Christmas. Both are taken by surprise when unexpected circumstances present themselves. Kara and Jessie are two teenage girls from very different worlds, but with a little Christmas magic, they find they have much more in common than they ever imagined. During their Christmas break, a group of sorority girls are stalked by a stranger. This Christmas, Thunder Mountain Ski Resort is abuzz when celebrity chef Shane Roarke is named the new head chef. Clara Garrison isn't as excited and is instead focused on getting resettled after her failed attempt at opening a restaurant in the city. With their paths constantly crossing, will their shared passion for cooking bring them together or will secrets keep them apart? Holly Khun, known to Chicago as “Miss Christmas,” always finds a beautiful tree for the plaza, but this year’s was damaged, and the lighting ceremony is in 10 days. Hoping for a miracle, she combs through fan mail, and finds Joey McNary of Klaus, Wisconsin, has the perfect tree. Off she goes to Klaus, where she meets Joey’s handsome dad Sam. Sloan is beautiful, stylish, and on the fast track to success at her public relations firm. After her client Caitlin ends up in a coma and becomes her own personal ghost of Christmas past, present, and future; she finds out first hand that her unethical ways needs to change and reuniting with a past jilted lover may be the answer. Lucky Christmas is the story of Holly Ceroni, a single mom trying to get back on her feet, but who is crushed to learn her winning lottery ticket is in the glove compartment of her recently stolen car. Mike Ronowski, the construction worker behind Holly's missing property, goes along with a master plan to befriend Holly and coerce her into giving him half of her winnings. Mike unexpectedly falls in love with Holly and learns there are more important things in life than quick money in time for the holidays. In suburban Chicago during the late 1980s, ten-year-old Jake Doyle embarks on a herculean quest to get the latest and greatest video game system for Christmas. A stressed out lawyer and mother of three gets her yuletide wish when she wishes to see what her life would be like if she had chosen to pursue her career in Law rather than marrying and becoming a working mother. A ne'er do well father and ex-husband who always raced his way through the holidays is forced to relive Christmas Day time and again until he gets it right in this family oriented fantasy comedy starring Jay Mohr. It's Christmas time once again, and as usual Kevin (Moore) is scrambling to get his son Ben a last minute gift before stopping by his ex-wife Jill's house for a quick swig of eggnog. Ben can't stand Jill's impossibly perfect new boyfriend, and the prospect of spending the entire evening with his former inlaws is nearly too painful to ponder. But this Christmas things are going to be different, because this Christmas might just last forever. At first Kevin resists the curious development by simply reverting to his childish ways, though he is about to find out that sometimes in order to build a better future one must finally make amends with the past. ~ Jason Buchanan A special yuletide collection of classic moments with Mickey Mouse, Donald Duck, Goofy, Chip 'n' Dale, Cruella De Vil and many other Disney favourites. The movie contains: Mickey's Mixed Nuts (2000), A Christmas Cruella (1997), Snow Place To Hide (1996) and of course the ever so funny classic, Toy Tinkers (1949) starring Chip and Dale in a battle against Donald. When architect and Christmas amateur Steven finds himself hosting his family for Christmas, he recruits holiday coordinator Gretchen to bring holiday joy to his home. Gretchen’s expert Christmas spirit brings Steven’s family together, but neither expected it to bring them closer to each other. After a great opportunity presents itself to Gretchen, she and Steven must decide what’s really important in life. Wendy Walton is the best designer in Boston... but no one knows it yet. Hoping to kick-start her career, Wendy has left work with the local theatre to take a job as an assistant to Priscilla Hall, the most prestigious designer in the city. Ms. Hall works Wendy around the clock, which is how Wendy finds herself trapped in an elevator late one night with an incredibly handsome stranger. Wendy and the mystery man share an impulsive, romantic, life changing kiss before the doors open and Wendy runs out, leaving him behind. The next day at work, Wendy answers the door to find the handsome gentleman standing in front of her. Identical twins Kate and Chris Lockhart plot to be the other sister – at Kate’s office and Chris’ school – and take on planning their sister’s Christmas events. One rule, though: no romance. Mickey, Minnie, and their famous friends Goofy, Donald, Daisy and Pluto gather together to reminisce about the love, magic and surprises in three wonder-filled stories of Christmas past. A toy factory worker, mentally scarred as a child upon learning Santa Claus is not real, suffers a nervous breakdown after being belittled at work, and embarks on a Yuletide killing spree. An overlooked middle child finds himself in the unexpected spotlight when he realizes his family's terrible Christmas day keeps repeating. As the only one experiencing the day over and over, he decides to use his unique gift to give the holidays a makeover and his family a Christmas they will never forget. Ally (Emmanuelle Vaugier) is a smart young career woman who needs a new job. Samantha (Cynthia Gibb) is a busy Beverly Hills advertising executive/mom whose too-well-mannered kids need some fun in their lives. And Danny Donner (Dean Cain) is the tough-guy owner of a chocolate company who wants a major ad campaign immediately. Could it all somehow lead to the Christmas that changes everyone's lives forever? Richard Ruccolo, Sierra McCormick, Jared Gilmore and Sarah Thompson co-star in this surprising comedy about little white lies, big holiday wishes, and a woman who may just find love in the most unexpected places by becoming A NANNY FOR CHRISTMAS. Sparks fly when a greeting card executive arrives in Santa Fe to acquire a tight-knit family company that creates ornaments inspired by Mexican Christmas traditions. Katie gets dumped right before Christmas and gets on a dating app determined to never spend another Christmas alone! But it will take more than an app and the advice of friends to help this girl find true love. It'll take a Christmas Miracle! Danville, Connecticut at the turn of the century. Young Richard Miller lives in a middle-class neighborhood with his family. He is in love with the girl next-door, Muriel, but her father isn't too happy with their puppy-love, since Richard always share his revolutionary ideas with her. Ma Delano runs a penny arcade in Coney Island, living upstairs with her sons and daughter. Story involves rum-running, accidental murder and a frame-up. Caillou learns about winter holiday traditions from around the world. He and his entire family celebrate Christmas, sharing, giving and caring. A selfish con-man must show that he can be a family man to inherit his uncle's estate. As he tries to set up his scam family, he realizes that he really wants to have a one. Join your favorite DreamWorks friends for these four holiday specials. Watch as those zany zoosters from Madagascar save Christmas, Donkey puts on a caroling Christmas Shrek-tacular, and Po prepares for his favorite holiday, the Winter Feast. A mysterious shopkeeper narrates four horror tales, each set during a different holiday. A tour documentary from the Australian rock group King Gizzard and the Lizard Wizard. A woman and a soldier exchange letters for a year before their worlds collide. Santa and Mrs. Claus, played by “Entertainment Tonight’s” Kevin Frazier and Nischelle Turner, respectively, enlist the help of Disney Channel stars to save the holidays from Ebenezer Scrooge (“Raven’s Home” star Anneliese van der Pol). The stars take on a series of zany holiday-themed challenges to lift her evil curse on Christmas. Krista is starting this New Year with a new business and a resolution to be more selective with who she dates. When Krista meets Ryan Rourke, an entertainment lawyer from LA, the two really hit it off. Ryan is in her hometown to sign a local rancher turned viral signing sensation as his new client. Now with Krista also in Rust Creek, maybe there is more of a reason to stick around. Both are holding onto things from their past and are forced to make some decisions if they truly want to be together. To make the 100th anniversary of her hometown's Victorian festival a success, Cassie invites action movie star and former high school classmate Jake to play Scrooge in A Christmas Carol. Bosko and Honey go on a picnic that ends badly. Jacqueline is living an unfulfilled life in a doomed marriage. After a chance encounter with a former classmate, she rethinks her life's choices and wishes she could go back to high school for a do-over. Like a Christmas miracle, Jacqueline awakens to find herself as a high school senior again with the ability to change everything. No overview provided. Colette runs a coffee shop that is known for her secret and famous hot chocolate. When Marcus, a new dessert shop owner, starts to draw in Colette's customers with his very own specialty hot chocolate that tastes exactly like the recipe from her beloved grandmother, she is determined to expose him. But as she gets to know Marcus, sparks fly between the cocoa connoisseurs. Taylor, a former juvenile delinquent, convinces straight-'A' student, Cammi to join her and her friends on a Spring Break road trip through the California desert. Ignoring evil premonitions from Cammi, the 8 friends party heavily as they get farther and farther away from civilization along old Route 66 with a killer in pursuit. Anxiety builds as each stop along the way proves stranger and stranger until the group is lured to an abandoned amusement park with a mysterious past far off the main highway. There the group discovers that the park comes complete with broken down vintage carnival rides, shocking surprises, the smell of death, and an enticing, young tattooed serial killer named Spider. When Sam, the designer behind a popular home renovation show, returns to her hometown during the holidays to help renovate the Bell Harbor Inn, she gets paired with Coop as her lead contractor. The only problem — he's the guy who broke her heart and she's the one who got away. Sparks fly as they work closely to get the renovations done in time for the inn's annual Christmas Eve Harborfest. A man is sent to a small town to assess which of the workers in the local factory that supplies the town with jobs should get the boot when the downsizing begins. He gets sidetracked when he falls in love with a local, a cute single mom. Holiday magic has never gleamed brighter as Santa’s Elves head out on an adventure to bring every boy and girl their Christmas wish while also bringing a family back together in this heartfelt Christmas movie from Gaumont. After accidentally destroying a bag of Christmas wishes from a small town on the eve of Christmas Eve, two junior elves learn that if even one wish goes unfulfilled, Christmas could be extinguished forever. For the first time in their lives, the elves Mindy and Cam venture out of the North Pole and sneak into Minnedoza to collect the lost wishes. Along the way they enlist the help of young Blake, whose family has a difficult time celebrating Christmas since his father died. With their deadline fast approaching, Mindy and Cam have only one more wish to find…but whose could it be? It’s up to Mindy and Cam to find out and save Christmas! Featuring a variety of holiday-themed episodes from everyone’s favorite sea-dwelling sponge. Included are the double-length episodes \"Christmas Who,\" as well as \"Procrastination,\" \"The Snowball Effect,\" \"Survival of the Idiots,\" \"Mermaidman and Barnacleboy IV,\" \"Chocolate With Nuts,\" \"As Seen on TV,\" \"Pizza Delivery\" and \"The Squeaky Boots.\" Born under the Christmas Star, Noelle believes she has the gift to perform miracles, so when conniving developer McKerrod threatens her peaceful life she and her friends determine to use this gift to thwart his plans and save their village. Tightly wound Ellie flies to Australia and enlists the help of an Aboriginal Tour Guide and a YouTubefamous Uber driver to find her husband and his eclectic family, and along the way, find her true self. All before Christmas. After Avery’s storybook Christmas wedding is canceled unexpectedly, dance instructor Roman helps her rebuild her dreams. Angie works hard to run her uncle’s events business while her cousin Candace takes the credit. When Angie takes a night off to have fun at the Christmasquerade Ball, the mask and gown allow her to let loose, and she quickly catches the eye of Nicholas, a wealthy local bachelor. But then Angie has to go before revealing her identity, leaving Nicholas searching for his mystery woman in this modern take on the classic fairy tale. Rowena aka “Ro”, a high-spirited 11-year-old hoping to add more spunk to her Christmas celebrations when her parents’ divorce is going anything but smoothly. Hoping get things back to the way they were before her father’s new girlfriend and her son entered the scene, Ro makes a wish to a mall Santa. However, her Christmas wishes go awry as Ro finds herself living the same day over and over again. Stuck in this endless loop, Ro must learn to love her new blended family and learn the true meaning of Christmas. In 1843, despite the fact that Dickens is a successful writer, the failure of his latest book puts his career at a crossroads, until the moment when, struggling with inspiration and confronting reality with his childhood memories, a new character is born in the depths of his troubled mind; an old, lonely, embittered man, so vivid, so human, that a whole world grows around him, a story so inspiring that changed the meaning of Christmas forever. When a driven doctor doesn't get the prestigious position she planned for, she unexpectedly finds herself moving to a remote Alaskan town. While she meets the locals and even starts a new romance, she has to learn to let the life she planned for give way to a love she never could have imagined, and finds this festive small town is hiding one big holiday secret. Working through some difficult decisions, Mitchell family matriarch Phylis and patriarch Bill, have summoned their two grown sons – TV stars Mike Mitchell and Brandon Mitchell – home for the holidays. It is their hope that bringing the family together to recreate the Christmas house, will help them find resolution and make a memorable holiday for the entire family and community. Lincoln Loud gears up for the ultimate Christmas, until he finds out that most of his sisters have plans to be elsewhere for the big day. Determined to remind his family that they all need to be together, Lincoln and his best friend Clyde McBride embark on a mission to preserve the family’s holiday traditions. Santa has an accident at Fred's house on Christmas Eve, Fred and Barney have to continue his run for him. At the height of her career, investigative journalist Hannah Dunbar finds herself wondering what would have been had she stayed with the love of her life, Ben, 10 years before. When Santa Claus hears her “what ifs?” as a Christmas wish, he transports Hannah to a version of her life where she and Ben started a family. Christmas brings the ultimate gift to Aldovia: a royal baby. But first, Queen Amber must help her family and kingdom by finding a missing peace treaty. The story of New York lawyer Hugo who heads to Milwaukee with his best friend Madelyn to spend the holidays with his mom Kate, who is also in charge of the local Christmas celebrations. Ever the matchmaker, Kate arranges for Hugo to run into Patrick, Hugo’s high school friend and secret crush, who has recently returned after a successful stint in Silicon Valley. As they enjoy the local holiday festivities together, Hugo and Patrick’s attraction to each other is undeniable and it looks as though Kate’s Santa-style matchmaking is a success. But as Hugo receives word of a big promotion requiring a move to London, he must decide what is most important to him. Estranged from his father, college student Jake is lured home to New York for Christmas with the promise of receiving a classic Porsche as a gift. When the bullying football team dumps him in the desert in a Santa suit, Jake is left without identification or money to help him make the journey. Meanwhile, his girlfriend, Allie, does not know where he is, and accepts a cross-country ride from Jake's rival, Eddie. Ally Morgan is a workaholic ER doctor struggling for work-life balance with boyfriend, Josh. On the night they breakup. Ally is miserable alone before a chance encounter with handsome barista, Gabe leads her to fulfill a Christmas bucket list of fun activities she never would have done on her own. Ally's best friend and fellow ER doctor, Dawn has never seen Ally so engaged outside of work and is rooting for a Gabe-Ally relationship. Now, the saintly Maureen must redirect Gabe's heartfelt intentions if Josh and Ally have any chance at reconciliation this Christmas. Hilarity, romance, and transcendence prevail after a power outage traps six different groups of New Yorkers inside elevators on Christmas Eve. Unlucky in love city lawyer Kelly Mitchum returns home to spend Christmas with her family. As she dreams of finding her perfect man, she meets handsome contractor Forrest Newell – and he ticks all the boxes! Now, with her family’s home at risk of demolition, will Forrest be able to help? And will the magic of Christmas be enough to save it? Astonished to find the Beast has a deep-seeded hatred for the Christmas season, Belle endeavors to change his mind on the matter. A man is sent to a small town to assess which of the workers in the local factory that supplies the town with jobs should get the boot when the downsizing begins. He gets sidetracked when he falls in love with a local, a cute single mom. Margaret Rockland is as depressed as the ubiquitous Christmas carols are cheerful when she returns to the Washington DC suburb of her childhood for a reunion. The wild bunch she grew up with have settled into respectable family life. Adding insult to injury, her former boyfriend is engaged to the most bourgeois blonde on the East Coast. Margaret reacts by diving into a drinking and drugs marathon. With two remaining fellow souls, she roams the suburban no man’s land and ends up in an incomparable adventure with kidnapping, extortion, misunderstandings and clumsy violence as basic ingredients. Join Timon and Pumbaa, your favourite friends from The Lion King, for outrageous laughs and high-spirited, globe-trotting adventures. First destination - Africa. In 'Kenya Be My Friend', Timon and Pumbaa forget how to be friends when Timon forgets 'Bestest Best Friend Day'. In 'South Sea Sick', Timon plays doctor when Pumbaa eats a bad bug - but the cure may kill first. Then in 'Uganda Be An Elephant', Pumbaa learns he's happy just being himself after he tries to be one of the more popular animals in the jungle. Then, it's off to Central America in 'How To Beat The High Costa Rica'. A crook and his money are soon parted when Timon and Pumbaa try to recover stolen money from the evil bank robber, Quint. The story of two queens who set out to create a classic Christmas TV variety show, but just can’t agree on how. DeLa tries her hardest to uphold the cheery Christmas traditions of her childhood. Meanwhile, Jinkx is much more interested in bawdy jokes, cute boys, and boozy libations. A stuffy family man cheats on his wife but she refuses him a divorce at first. Meanwhile his mistress resents her second class status. Lively holiday in Blackpool, with jazz accompaniment. No overview provided. Hoppy, California, and Lucky travel to Mesa City for a short vacation. California buys new clothes and carrying his old ones in a suitcase, bumps into escaping bank robbers in the dark. His suitcase gets switched with that of the robbers and he is seen with the money. Hoppy must find the money that has mysteriously disappeared and also the robbers so that he can clear California who is now in jail. Muskaan is a shy, wealthy girl who visits Goa with her family. She meets Dino, a dance performer at the local holiday resort. A remake of the 1987 American film Dirty Dancing. Scrappy does not want to get up and go to school. As the days peel off his calendar, the dates representing holidays come to life. Father time, in particular, takes Scrappy on a tour of the other holidays, stopping at dioramas representing Christmas, New Year's, Easter, and taking some eggs from Easter over to the feasts of Thanksgiving. Then he wakes up, and has to hurry to get to school on time. Sailors Pike and Shorty are on leave when a street woman swindles them out of some money by telling them she is looking for her long-lost brother, a sailor. A screenwriter falls in love with a Mexican woman while searching for a story line south of the border. An American businessman returns from a hunting trip to find fascists have overrun the country in this propaganda film. The cast of “High School Musical: The Musical: The Series” delivers an abundance of feel-good holiday cheer as they perform their favorite Christmas, Hanukkah and New Year’s songs and share their fondest holiday memories. A group of college students stay at school over Christmas to work at a special exhibit in the college's fine art gallery. The students have little in common to each other. When they decide to hold an unplanned Christmas Eve dinner in the gallery, they stumble into a trio of bumbling thugs planning a Holiday Heist of the exhibit. As the students are held hostage, they are forced to learn about themselves and each other, the spirit of Christmas, and get the courage to work together and fight back to foil the thieves. With heartfelt talks, wild escapes, and Christmas romance -- the night ends up being a Christmas Eve these new friends will never forget! The Huggett family go to a holiday camp, and get involved in crooked card players, a murderer on the run, and a pregnant young girl and her boyfriend missing from home. A young man named Peyton moves to Los Angeles with his girlfriend. Over the course of three years and six parties, Peyton goes into a world of drugs, sex and electronic blues music to find himself. Returning for a third iteration, “The Disney Holiday Singalong” features more music and magic just in time for the holidays. The one-hour festive musical event includes star-studded performances, animated on-screen lyrics, more favorite Disney melodies and classic holiday songs. The unique Bennett-Song family learns the true meaning of the holidays as they solve a community crisis and adapt to big changes. Everything you want in a holiday film: love, the power of belief, laughter, tears, and new musical classics. American tourist Gene LePere (Lee Remick), on vacation in Turkey, is hounded by a street vendor into buying a carved head she doesn't want. Then she is cast into prison for smuggling an antique. When Grouchy Smurf behaves badly to everyone and refuses to celebrate Christmas, the Smurfs of Christmas Past, Present and Future teach him to appreciate Christmas. It's holiday time, and while New York City bustles with yuletide celebrations, the Pink Panther suffers one misadventure after another... all in hopes of finding a warm heart and a warm meal! Finally, the Panther learns the true meaning of Christmas... and friendship. Eve is a Christmas movie fanatic and dreams of having a movie-perfect Christmas with a movie-perfect boyfriend. On Christmas Eve, when Eve and her cynical sister Lacy make wishes to Santa, they wake up in Christmas Town and find themselves trapped inside a Christmas movie where they are the stars. But when things start to go wrong, and Eve's knowledge of all things Christmas movie fails to fix things, Eve and Lacy try to find a way out of the picture-perfect Christmas and back to reality. When Haley Hollis returns to her family ranch to try and save it from closure, she wasn't banking on spending so much time with ranch hand Kate - or falling for her. When a mysterious key and a holiday riddle arrive on their doorsteps, Kate and Kevin embark on a Christmas romance adventure they’ll never forget. With Christmas approaching, life appears to be good for Tom, an ex-Olympic hockey star, and his girlfriend, Jenny, a firefighter -- at least until Mary, a former Olympic figure skater, Tom's soon-to-be ex-wife and the author of a book of tips on relationships, is convinced that appearing to be still happy with Tom will help sell her book. Tom's strong desire to spend the holidays with his and Mary's daughter provides a test of true love and, ultimately, reveals who the true heroes are. When a familiar-looking stranger crashes in without a memory, cory helps him remember the magic of Christmas to save the holiday for everyone A young man seeking a father he has never met, through no fault of his own, ends up barricaded in a liquor store with five other people on Christmas Eve in the fictitious town of El Camino, NV. Kibosh, supreme ruler of all ghosts, decrees that casper must scare at least one person before Christmas Day so Casper visits Kriss, Massachusetts where he meets the Jollimore family and sets out to complete his mission. As usual, kindhearted Casper has a ghastky time trying to scare anyone; so The Ghostly Trio, fed up with his goody-boo-shoes behavior, secretly hires Casper's look-alike cousin Spooky to do the job-with hilarious results. A woman falls in love with a man who is somewhat unavailable. A retelling of the classic Dickens tale of Ebenezer Scrooge, miser extraordinaire. He is held accountable for his dastardly ways during night-time visitations by the Ghosts of Christmas Past, Present, and future. As her new romance blossoms, a single mother, Olivia, is dismayed when her boyfriend, Scott, a military sergeant, is deployed right before Christmas. Determined to not let it ruin the holidays for her and her children they decide to give back to the struggling military families on his base and, as their efforts go viral, they are rewarded in ways they never imagined. A middle-aged man’s relationship with a young model is questioned by his daughter, who’s dating an older man herself. When Santa Claus decides to retire and pass on his magic bag of Christmas surprises to a new Saint Nick, he enlists the aid of a hilarious assortment of characters. A perky teen runaway and hapless taxi driver Ernest P. Worrell must convince a skeptical kiddie-show host to take over the post of Father Christmas. Spoiled socialite will learn a lesson after her father asks her to work in a family homeless center. When Alice, a beloved neonatal intensive care unit supervisor, is forced to take early retirement, her young colleague Jenny decides to turn the upcoming staff Christmas party into a surprise celebration for her. The plan is complicated by Matt, the hospital’s new CFO, who’s been tasked to cut costs. Initially at loggerheads, Jenny and Matt get to know and understand each other —a sweet Christmas gift neither saw coming. When Anna Parisi, an unemployed fine arts painter, is unable to make ends meet, she is hired to become a personal Christmas shopper for Marc, an uptight corporate exec.  As they begin working together, Marc learns that Christmas giving has less to do with the amount of money spent and more to do with the importance of the gift, while Anna discovers she might find success as an artist in a way she never expected.  The best gift of all of course is the love they discover with one another. Sometimes, life just seems to hand you exactly what you need – particularly at Christmastime. Riley is scraping bottom when she miraculously lands a job with a wealthy New York City entrepreneur. He’s a bad-boy socialite type who is poised to play Scrooge by closing one of his factories just before Christmas, which would devastate an entire town. It’s left to Riley to talk him out of it and turn him into a man of virtue rather than shame. Twenty-eight-year-old Georgia is convinced the man of her dreams is \"the one that got away\" back in high school. When Georgia learns of her high school reunion a week before Christmas, she's ecstatic to finally have her chance to win Craig back. But as she gets to relive high school for a night, she begins to realize it might not be Craig at all who got away, but Ben, an old friend with whom she'd fallen out of touch. Friends Ted and Andre are down on their luck with no plans for Christmas. Late one December night, they are visited by a strange guest with an unusual request for help. Comedian Bob Hunter is aided by his French counterpart Fernydel and two beautiful blondes when he is targeted for death by a powerful European counterfeiting ring. After years of questioning why people fear him, Death takes on human form so he can mingle among the mortals and find an answer. However, events soon spiral out of control as he falls in love with the beautiful young Grazia, the only woman not afraid of him. As he falls in love with her, her father sees him for what he is and begs him to return to his duties. Death must decide whether or not to seek his own happiness or sacrifice it so that Grazia may live. Remake of the 1953 original. Princess Elysa is touring Rome, and decides to get \"out and about\" away from her normal life. She meets with an American reporter and his photographer, who show her the sites. The reporter is initially more interested in a story than the Princess, but begins to fall for her. Kindhearted Samantha Parkington's world starts to change the day Nellie O'Malley walks into her life. Nellie, her father, and her two little sisters have moved in next door to be servants for the Ryland family. Though they come from completely different backgrounds, Samantha and Nellie become fast friends. The girls turn to each other in happiness and sorrow, adventure and danger. A dysfunctional family attempts to share the living room after Christmas dinner. But, there's still one gift left to be opened. Maurice’s (26) family organizes a weekend getaway. The balance of power between the different generations seems to be blurred, but is he willing to keep up appearances just like the others? Two couples, one from St. Louis and one from Switzerland each go to the other's country and travel around. As the scene opens, window washer Woody washes the window of Pierre's bakery. His first mishap is to cause Pierre to mess up a cake that he's decorating, and Pierre tells him off. Since this job is finished, Woody gets on a bus with his automatic extension ladder, which keeps hitting the bus driver in the head every time that the bus stops. The driver finally throws Woody off, but Woody manages to get back on. The comedy with the ladder continues, finally involving a traffic cop, a motorcycle policeman and Pierre, as well as Woody and the driver. The story ends with all the participants, on the motorcycle, crashing into a brick wall. A group of teenagers take jobs at a holiday camp for the summer and enter a TV talent show A guard (William Bendix) befriends a wayward youth (Allen Martin Jr.) sent to the Indiana Boys School. Dagwood gets a raise due to a new contract with a bank manager.  Blondie misunderstanding the amount of the raise pledges more than they can afford to Dagwood's high school reunion organizer who was also Dagwood's high school sweetheart.  To make matters worse Dagwood becomes involved with a gang running a gambling establishment. Academy Award-Winning Actress and \"The View\" Co-Host Whoopi Goldberg Reveals Disney Holiday Secrets in Freeform's \"Decorating Disney: Holiday Magic\". Compassionate holiday romancer with Connie Sellecca as a divorced mother who takes young daughter Asia Vieira to her small South Carolina hometown in order to start a new life. Once there, Connie has trouble getting ready for Christmas as Randy Travis, her former boyfriend comes calling, and a runaway boy and social worker take up a lot of her and her daughter's attention. With Rue McClanahan, Don McManus. Based on Kathleen Creighton's \"A Christmas Love. In this thriller, an American schoolteacher visits St. Petersburg, Russia and ends up entangled in a deadly plot to steal a valuable artifact. Join your favourite DreamWorks friends for these four holiday specials. Watch as those zany zoosters from Madagascar save Christmas, Donkey puts on a carolling Christmas Shrek-tacular, and Po prepares for his favourite holiday, the Winter Feast. In the holiday themed, hour-long episode, “Shapeshifters Anonymous,” fearing he is a murderer, an anxious man searches for answers for his “unique condition” from an unusual support group. Beautiful manicurist Hallie Hobart sets her sights on handsome David Stone, the son of wealthy wheat farmer Ezra Stone. Professing to hate men, Hallie is only interested in luring David in for a lucrative business deal. David easily falls in love, but older brother Mark brands Hallie a gold-digger. To get even with the straight-laced Stone family, Hallie accepts David's marriage proposal. Queen Poppy plans the first annual Trolls Kingdom Secret Holiday Gift Swap, but, things don't go as expected. College students rally to save a struggling hotel from closing. Comedy. Miley Cyrus performs a six-song set for Amazon Music's 2020 Holiday Plays special, including \"Plastic Hearts\" from her just-released album of the same name, her single \"Midnight Sky\" and a cover of Wham!'s \"Last Christmas.\" Cyrus also sits down for an interview with host Lil Nas X. With her California hometown in the rearview mirror, Belle heads north on business to catalog the sale of a large mansion. While the job is a dream, the client, Hunter Lowell, is not. But, as the two spend more time together, his icy demeanor begins to melt. Although their relationship is budding, Belle’s long-time suitor, Tony, arrives, sending mixed signals to Hunter while adding chaos to the holiday season. Christmas designer Leslie Major (Brely Evans) is the biggest fan of Christmas ever. She is like a tidal wave of Yuletide cheer. Her biggest job every year is decorating the lobby of the famed Chesterton Hotel. As she is on a ladder decorating the tree, she falls into the arms of Edmund James (Andra Fuller) - the grandson of the owner JJ James. Edmund is all business and thinks Christmas is superficial and frivolous. Six years have elapsed since Guantanamo Bay, leaving Harold and Kumar estranged from one another with very different families, friends and lives. But when Kumar arrives on Harold's doorstep during the holiday season with a mysterious package in hand, he inadvertently burns down Harold's father-in-law's beloved Christmas tree. To fix the problem, Harold and Kumar embark on a mission through New York City to find the perfect Christmas tree, once again stumbling into trouble at every single turn. Amy Pond and Rory Williams are trapped on a crashing space liner, and the only way the Eleventh Doctor can rescue them is to save the soul of a lonely old miser. But is Kazran Sardick, the richest man in Sardicktown, beyond redemption? And what is lurking in the fogs of Christmas Eve? A bubbly bride-to-be’s Christmas plans take an unexpected turn when her holiday flight to New York is detoured and she encounters a cynical bar manager who has lost his faith in love. As she scrambles to make it back east for Christmas—and plan her upcoming wedding—she begins wondering if she’s marrying the right man, and learns a surprising lesson about love. A peaceful Christmas Eve is interrupted when a thief breaks into a villa. When the family’s little daughter mistakes him for Santa Claus and asks him to fulfill her Christmas wish, he will be forced to perform a miracle that will redeem secrets from the past. When Marie begins receiving ornaments from her mother, a new coincidental blessing comes with each one, causing Marie to feel more excited for the holidays than she has in years. Marie’s once-lost Christmas spirit gets another boost when she meets her handsome neighbor Nate and feels a spark with him while celebrating the season. Allie Foster, a struggling New York artist, reluctantly accepts to act as a governess to a rebellious Princess Theodora of Winshire. When Allie forms an unlikely bond with the princess, she attracts the attention of the handsome King Maximillian, who’s facing an arranged marriage against his heart’s wishes. As Christmas Eve draws near, Allie finds herself swept up in romance, royalty and the spirit of the holidays. A Madison Avenue executive, Amy, discovers an unusual Christmas surprise when she inherits her Aunt’s hometown bakery. The real surprise comes when she learns the other half of the bakery was left to her long-ago boyfriend, Jack. Unresolved personal issues resurface between them, as the exes return home to co-manage the store, along with its traditional holiday cookie bake-off. Years after their personal and professional breakup, the singing duo of Georgia and Joe Winter agree to reunite after their daughter, Belle, asks them to participate in a Christmas Charity concert, only to find themselves getting back in tune on stage and off. A magical Christmas wish makes a career-obsessed June say yes to every invitation while she's home for the holidays. But when an old flame, Blake, joins her hectic schedule of Christmas activities, past feelings are reignited. June must choose between saying yes to her career and life in the city or to her heart in her hometown. Maddie, a reporter for a Norfolk newspaper, embarks on a Tiger Cruise during Christmastime where she meets a handsome naval officer and stumbles upon a mystery in the ship’s archive room. A year after Amber helped Richard secure the crown. The two are set to tie the knot in a royal Christmas wedding — but their plans are jeopardized when Amber finds herself second-guessing whether or not she's cut out to be queen, and Richard is faced with a political crisis that threatens to tarnish not only the holiday season but the future of the kingdom. Sonic the Hedgehog must stop the evil Dr. Robotnik from ruining Christmas after Santa Clause disappears When Charlie Brown complains about the overwhelming materialism that he sees amongst everyone during the Christmas season, Lucy suggests that he become director of the school Christmas pageant. Charlie Brown accepts, but is a frustrating struggle. When an attempt to restore the proper spirit with a forlorn little fir Christmas tree fails, he needs Linus' help to learn the meaning of Christmas. During the Christmas season, Megan and her father-figure Frank head out on a road trip to find his long-lost love. Along the way, Megan finds the love of her own life. For years Lucy has played Santa to her small town’s community by making their holiday wishes come true. But when Lucy grants a little girl’s wish for a Christmas like she used to have with her mom, she unexpectedly finds her own wishes coming true in life and love. Laurel, a Chicago-based business executive, travels to Memphis to secure one of the city's oldest family-owned banks. While in Memphis, Laurel reunites with old flame Clay, a local music promoter with loftier aspirations. Though Laurel tries to keep her eye on the prize of the business acquisition, Clay is very persuasive reminding her of the days when they were a performing duo on the brink of stardom. Now Laurel's focus turns to the home of the Blues and dreams of making music again. With Christmas approaching in New York City, historian Jessica is hired to create an exhibition honoring the history of Christmas at The Plaza Hotel. When she is paired with Nick, a handsome decorator, they wind up enjoying a host of holiday traditions together and find themselves falling for each other. Maddie, a high-powered marketing executive, is on her way to a client’s wedding but her plans are derailed by car trouble. When a fork in the road leads her to Christmas Valley, a town in love with Christmas, an unexpected encounter and a group of strangers that start to feel like family will have her questioning what she’s really been missing in life. Before Star-Lord, Gamora, Drax, Rocket, Mantis and Groot hit the big screen with the next Guardians of the Galaxy film in 2023, watch the Guardians engage in some spirited shenanigans in an all-new original special, created for Disney+, during the 2022 holiday season. Three old friends reunite during Mardi Gras and try to forget their problems. Drama based upon events that took place on a desolate Navy radio base on Kodiak Island, Alaska in 1962. It recounts the terror faced by young sailors at the hand of a fellow sailor and psychopath - framed against a backdrop of the Cuban Missile Crisis. A woman and her son make a trip to Morocco alone, as her husband has had an emergency. There she is attracted by a tour guide who begins a passionate affair. One night, returning to the hotel, is waiting her husband. The narrative driving Holiday Weekend is centered on people and how they relate to each other. A young couple quibbles over an impulsive decision to steal a coffee machine, while the victimized pair sans Sanka plays an unusual game of affection and abuse. A young man with werewolf-ism moves in with a fledgling songwriter, while elsewhere, an injured individual with Tourettes seeks council from a high priced lawyer. All the while, some elderly homosexual lovers reunite, dancing to celebrate the rekindling of their long dormant love. Giving us his spin on spirituality and the afterlife, Holiday Weekend is like several small sketches that add up to one incredible portrait. Death takes a human form and visits Earth to try to find out why humans want so desperately to cling to life. He unexpectedly falls in love with a beautiful young woman. Louis goes to South Africa where American tourists pay to hunt wild animals in privately owned reserves. SPIRIT is inspired by the four elements, taking audiences across continents and cultures. From dawn in Asia, through Celtic Reels to a Chinese firework festival and the excitement of a Native American Pow Wow. Spirit translates Form and Balance, Creation and Harmony into an exhilarating and spiritual celebration of skating. Raven-Symoné virtually hosts the challenge, which features “ZOMBIES 2” stars Milo Manheim, Kylee Russell, Ariel Martin, and Pearce Joza competing in a holiday adventure through Magic Kingdom Park. After iconic Disney villains Maleficent and Evil Queen steal holiday magic, the stars must overcome obstacles and complete challenges to restore the joy of the season. The challenges take place throughout Magic Kingdom Park and include iconic attractions and locations like Haunted Mansion and Cinderella Castle. The four stars are also competing for a grand prize that will benefit Toys for Tots, a nonprofit organization that delivers hope and the magic of the holidays to less fortunate children. Aside from taking a look inside Disney Parks during the holiday season, the show features musical performances from both Disney Channel stars and famous faces from “Descendants 2!”  Disney Channel stars Dove Cameron, Cameron Boyce, Sofia Carson and Booboo Stewart will perform “Jolly to the Core,” while star China Anne McClain will sing “This Christmas.”  Additional musical performances include:  “Silent Night,” performed by Hollywood Records and Republic Records recording artist Sofia Carson.  Kelly Clarkson performing a song from her 2013 holiday album “Wrapped in Red.”  Forever In Your Mind performing “Celebrate.”  Trisha Yearwood and Garth Brooks perform a holiday duet from their new album, “Christmas Together\" Traveling from Transylvania to Scotland by train, the Count's two companions Lucy and Renfield start on a series of changes in order to get the Count over his many fears - sunlight, crosses, bibles, running water, garlic, food and drink. After the fall of the Berlin Wall, Lena, from East Germany travels to Hollywood. After landing she loses her bag and can't find her hotel. She befriends a cab driver who doesn't believe someone is out to get her. Holiday on Ice races into a new area with the production of Speed! From the speed of instinct, love, money, time and even light speed, this show is taking audiences to amazing revolutions per minute, never before experiences with professional skating. Speed is breaking the barrier not only with cool skaters, but stunt men, aerialists, snow bike drivers, featured dancers and short track ice racers. Geeky school kid Andy dreams of being a great inventor, but he’s having trouble coming up with a “big idea” that will win the Science Fair and beat scheming twins April and May.  Even worse his Dad is pressuring him into joining the football team, that he just happens to coach and his big brother just happens to be the star of. Andy decides to ask the town’s resident scientist, Dr. Frankenstein, for advice, but on a visit to his creepy mansion instead he meets a green football-loving teenage monster named Frank, who wishes he could join in the way Andy can.  Excitedly Andy realizes that he and Frank may just be able to solve each other’s troubles by switching places, and his plan goes smoothly until suddenly they’ve got a monster problem on their hands that threatens the entire town. BELIEVE is a modern day Romeo and Juliet about desire, jealousy and true love. With Olympic level choreographies combined with the best live music, beautiful decors, glamorous costumes and hi-tech special effects, BELIEVE is destined to become a show that will truly conquer hearts. Lively June (Jane Withers), teen-aged daughter of mystery writer Waldo Everett (Jon Qualen), who calls her \"Angel,\" becomes involved in intrigue centering on movie star Pauline Kaye (Sally Blane) and her companion Stivers (Joan Davis). Reporter Nick Moore (Robert Kent), once sweet on Pauline, is convinced that her sudden disappearance is a publicity stunt, which is true -- until gangster Bat Regan (Harold Huber) decides to get involved. PASSION takes you into the lives of our figure skaters. From the passionate beginnings, the sacrifices up to the big success – the beauty, the ambition and the glamour. The show tells the life of the ice skaters: the true stories and the look behind the scenes. Energia takes audiences on an epic journey through time and space to discover the deeper message of how the universe is connected. The show’s theme is light energy which is being used in many different ways, sometimes literally but also in several metaphorical ways. No overview provided. The show Festival is a grand celebration – inspired by the very best Holiday on Ice moments of the past, and full of stunning, multi-coloured contemporary scenes. From the moment the audience enters the arena it is obvious something dramatic is going to happen: The giant and stunning, explosive and colourful “tornado” set hovers over all, giving the feeling the party is about to get started. A New York sales manager is sent to the remote Scottish Highlands at Christmas to acquire a limited edition perfume from a dashing Earl preparing for his annual ball and falls in love instead. Nicole learns to deal with grief, with the help of her grandfather and a carpenter she hires to renovate the home that was once meant for her and her fiancé. Christmas comes to Heartland, along with an anonymous call about starving horses stranded by an avalanche in the Rocky Mountains, which send Amy and Ty to their rescue. In an attempt to win back her ex-boyfriend on Christmas Eve, Kate ends up ruining her blind date with Miles, a handsome guy she's been set up with. In a strange twist of fate, Kate is given the chance to re-live Christmas Eve twelve times. Madea dispenses her unique form of holiday spirit on rural town when she's coaxed into helping a friend pay her daughter a surprise visit in the country for Christmas. Emily (Faith Ford) misses her daughter Heather (Emma Lahana), who is attending college in Boston. Since her father died, Heather is sensitive to her mom’s dependence on long-standing holiday traditions. This Christmas, Heather has planned a trip to Phoenix with her boyfriend, but tells her mother she is staying on campus to study.  After Emily arranges a house-swap with Charles (Tom Cavanagh), an English professor from Boston who wants Washington State’s solitude in order to finish his novel, Emily hops on a flight to Boston to surprise Heather for Christmas. Unaware of the house swap, Emily’s best friend, Faith (Gabrielle Miller) walks in on Charles at Emily’s house and in Boston, Ray, Charles’ brother (Gil Bellows) responds to a 911 call only to find Emily at Charles’ condo. Will Christmas travel calamities lead to cross-country romances? Or have there been one too many surprises already? Three kids and their Dad move from L.A to Edmonton. When they go shopping at West Edmonton Mall they find counterfeit cash. They inadvertently help catch the crooks, and later make a discovery about Santa A doctor returns home for Christmas to find that her father has decided to retire from his own practice. After reuniting with her high school sweetheart, she wonders if she should stay and take over her father's practice. After a breakup with her boyfriend, a young woman moves in with her older brother, his wife, and their 2-year-old son. Charlotte Hart, a distinguished journalist, is spending time with her family over the holidays when a real estate developer approaches their small town with quite an offer. Skeptical and looking for the real scoop, Charlotte drives to see the real estate head honcho to question him. While she's en route, she gets into a terrible car accident and wakes up in the hospital only to realize that her body is in a coma, but her spirit is very much awake. She meets another spirit, who just happens to be the greedy developer. It turns out that he was on the other end of the accident and he too is in a coma. With only a few days left before the town votes on the development, Charlotte must try to change the minds of the developer and the town, but that is no easy task when no one can see or hear her. Will her voice be heard? Molly Gallant (Molly McCook), a Los Angeles-based marketing executive on top of the world returns to her mother’s home town of Peppermint Hollow after her plans to launch a business are derailed by circumstance. Drummond plays the owner of a bakery who befriends the woman and introduces her around town. The role was penned for Drummond, who is known for her bright smile and cheery approach to rustic home cooking. Jackie Foster, a dynamic Assistant District Attorney and single mom, is looking forward to wrapping up her latest case and spending Christmas with Gracie, her adorable and precocious, eight-year old daughter. But when Jackie’s estranged dad, Jack , a gruff retired police officer, unexpectedly shows up at her door, they will be forced to confront old wounds. Kirk is enjoying the annual Christmas party extravaganza thrown by his sister until he realizes he needs to help out Christian, his brother-in-law who has a bad case of the bah-humbugs. Ashley has been on her own all her life. She feels even more alone this Christmas as she searches fruitlessly for a job. The seasonal cheer around her only rubs salt in her wounds as she scrapes by to support herself and her dog, Dash. But her neighbor, Nick, knows exactly what to do. He offers her a job, to be his assistant in the best work-helping others. There's one catch that Ashley must honor though-she can't tell anyone that her new boss is a sort of Secret Santa, helping others anonymously. Through her new job, Ashley meets Will, a writer for a business magazine who uncovers what Ashley is doing, and more importantly, Nick's involvement. As Ashley and Nick help people in need, Ashley tries to protect Nick's secret, and her own heart, while Will must weigh the consequences of what he does. Sara Shaw is the type of woman who prefers to sit on the sidelines at work, but when her big idea for a Christmas initiative is stolen, she makes a wish to Santa that she'll finally have the courage to stand up for herself. Santa grants her wish, but only gives her 48 hours. As the clock ticks, Sara will discover how to channel the Christmas magic and speak her mind all on her own. Adventurous flight attendant Sydney’s plans for a tropical Christmas get delayed when she helps an unaccompanied minor get home to Chicago to her dad Jonathan, a handsome widower and investigative reporter. Faced with a shortage of out-going flights, Sydney is marooned for several days in the Windy City – once her home as a small girl — and tags along with Jonathan, his daughter, and their exuberantly festive family until she can find a connecting flight. Jonathan makes her a deal: he helps her chase down the story of how her late parents met, and she helps him to write the perfect Christmas story and keep his job, and along the way, sparks form between them. All the favourite Disney stars feature in this Christmas special which contains 7 short stories and a healthy dose of Christmas spirit. A hopeless romantic who can’t ever seem to give a guy a real chance begins receiving each of the \"12 Days of Christmas” as gifts anonymously at her door. As she tries to figure out who is sending the gifts, she begins to believe that the mystery suitor could finally live up to her expectations. Pluto comes bounding outside to help Mickey get a Christmas tree. Chip 'n Dale see him and make fun of him, but the tree they take refuge in is the one Mickey chops down. They like the decorations, especially the candy canes and Mickey's bowl of mixed nuts. But Pluto spots them and goes after them long before Mickey spots them. Minnie, Donald, and Goofy drop by to sing carols. Weeks before Christmas, interior designer Laura is sent to her hometown of Santa Fe, New Mexico to remodel a landmark hotel. As Laura is kept busy with the renovations, her 8-year-old daughter Nicole is introduced to the art of salsa dancing at a local dance studio. Laura is surprised to find that the studio’s owner is Ricardo, her old high school sweetheart and former salsa dance partner. When Laura and Ricardo reconnect, sparks fly on and off the dance floor. The beautiful Christmas traditions of New Mexico become the backdrop for spirited dancing and unexpected romance. As a tribute to 70 years of Holiday on Ice, Platinum celebrates the timeless character that it represents since its founding in the United States in the forties. Platinum  features a wide variety of sounds from Brazilian electro to classical waltz, swing and gospel to Samba from the last 70 years of Holiday on Ice. Thanksgiving special starring Lady Gaga performing songs from Artpop and Muppet sketches. Christine Evans, the fifteen-year-old daughter of the widowed American ambassador to Mexico Jeffrey Evans, believes that she is no longer a young girl and that she has fully matured into adulthood. Eager to make her mark in the sophisticated world of foreign diplomats living in Mexico, Christine appoints herself as organizer of her father's social activities and takes over the planning of a big garden party he will be hosting. Because he loves his daughter, Delirious, deeply romantic tale of love and loss featuring a girl, golden nude, and akahara imori newt in a gondola resort. -JAPAN CUTS: Festival of New Japanese Film Holiday, a four act abduction thriller deconstruction, follows Anne as she visits Venice Beach and meets a friendly Brit, Graham. But Graham is not who he appears to be and Anne finds herself held captive in Mexico with no apparent escape. A young couple make their way to the airport, full of expectation. While flights to all four corners of the world are being announced, the pair turn\r the airport’s main hall into a place full of charisma – somewhere between a magical musical and a crazy amusement park. With Tropicana, Holiday on Ice takes everyone on an American journey: from the streets of New York, to the energetic colourful beach clubs. Imposing orchestral arrangements switch from Latin-pop and dream ballads to swinging Big Bang rhythms and Rock ‘n Roll feelings of the fifties. The wild and woolly early days of New York -- when it was still known as New Amsterdam -- provide the backdrop for this period musical-comedy. In 1650, Peter Stuyvesant (Charles Coburn) arrives in New Amsterdam to assume his duties as governor. Stuyvesant is hardly the fun-loving type, and one of his first official acts is to call for the death of Brom Broeck (Nelson Eddy), a newspaper publisher well-known for his fearless exposes of police and government corruption. However, Broeck hasn't done anything that would justify the death penalty, so Stuyvesant waits (without much patience) for Broeck to step out of line. Broeck is romancing a beautiful woman named Tina Tienhoven (Constance Dowling), whose sister Ulda (Shelley Winters) happens to be dating his best friend, Ten Pin (Johnnie \"Scat\" Davis). After Stuyvesant's men toss Broeck in jail on a trumped-up charge, Stuyvesant sets his sights on winning Tina's affections. Funniest and most unbelievable viral videos from the holidays. Nick Cannon shares holiday mishaps as well as adorable pets, mischievous kids and everything in between. A documentary about the legendary jazz singer Billie Holiday (1915-1959).  There exist many myths and legends about the Jazz Singer Billie Holiday — one of the greatest voices of the last century. Most of them tell the story of the tragic victim of drugs, alcohol, men, color, or the circumstances of her upbringing. To some extent she contributed herself to these legends, especially in her autobiography \"Lady Sings the Blues\". In recent years, more and more records and reports have shown a different picture of her. These statements of confidants, colleagues and friends clean up with many of the legends and show a strong personality who has been anything but a pitiable victim. Billie Holiday was a strong-willed and determined person and a very complex personality who did not correspond to the classic victim type. This movie is all about a normal guy called Billy Apples. He is a social drinker and sometimes lead singer of a band. While he is doing all of this, he still manages to bring up his teenage daughter. One night while sitting at home Billy finds that he has a talent! He finds that he is able to sing like his idol, 50's singer Billie Holiday. From there he is going places, from huge live performances to even cutting a hit record, but in the end he must make a choice between the life he has, and the life he once knew. Written by Graham Wilson Jr Four women take a boat trip to an island and run into a group of gangsters. Connie is a widow and mother whose work involves checking up on the competition for her department store employer.  When Steve, a charming salesman at a competing store, recognizes her true motives but refuses to expose her, he ends up getting fired as a result.  Feeling guilty, Connie agrees to buy lunch for Steve, striking up a friendship that complicates her relationship with Carl, a lawyer who wants to marry her. Larger than life hip hop diva, Leesa J, rekindles an old friendship over Christmas and her walk down memory lane forces her to reexamine her life, her habits and the real reason for the dislike for the holiday that she once loved so dearly. Timmy Lea and his brother-in-law Sidney Noggett are working as entertainment officers at Funfrall, a typical British holiday camp. The staff are lazy and inefficient, preferring to laze by the pool rather than organise activities for the holiday campers. A new owner, Mr. Whitemonk, an ex-prison officer, takes over the camp and is determined to install discipline into the staff. He is on the verge of dismissing Timmy and Sidney; however, Sidney's suggestion of organising a beauty contest changes his mind. A hobo participates in a bouncing-ball sing-along, featuring \"Big Rock Candy Mountain,\" a song that describes a vagrant's fantasy world. The gang runs away from home, but meet up with a kindly old couple. A bus conductor and his driver manage to round up a gang of criminals. In this comedy, three merchant marines get into all kinds of trouble. Two of the salts have just broken off their engagements after meeting other, more desirable women. Action film starring John Cheung as a traveler to Thailand who gets embroiled in a secret exchange of film. Along with a detective (Dorian Tan), he is eventually confronted by the thugs and dispatches them in various ways before heading back to Hong Kong. While in Thailand, his girlfriend (Sibelle Hu) is murdered and he picks up a new girl before leaving. Weeks before Christmas, interior designer Laura is sent to her hometown of Santa Fe, New Mexico to remodel a landmark hotel. As Laura is kept busy with the renovations, her 8-year-old daughter Nicole is introduced to the art of salsa dancing at a local dance studio. Laura is surprised to find that the studio’s owner is Ricardo, her old high school sweetheart and former salsa dance partner. When Laura and Ricardo reconnect, sparks fly on and off the dance floor. The beautiful Christmas traditions of New Mexico become the backdrop for spirited dancing and unexpected romance. A career-oriented single father and his 11-year-old son are forced to see their worlds through each other's eyes when some Christmas magic switches their bodies. The pair find themselves growing closer as they scramble to figure out the secret of the magic that caused their predicament in time for Christmas. A mother must protect her family on Christmas Day from a demented stranger who is hell bent on tearing them apart. Claire (Alexandra Breckenridge), a savvy venture capitalist from New York City, escapes to a quaint town in Vermont for the holidays and becomes a guest of the Fortenbury Bookstore. Upon arrival, Claire finds Christmas celebrations have been canceled by the town after a flood and the bookstore is in a dire state of disrepair. She immediately takes on the challenge to revitalize the store, but clashes with the owner, Andrew (Jamie Spilchuk), who initially rejects all her proposed improvements. Eventually, sparks fly as the two begin a budding romance, and Claire’s infectious optimism inspires Andrew to join her in reviving the yuletide spirit. But everything comes to a screeching halt when Claire discovers that Andrew is planning to sell the bookstore in the New Year. Will the spirit of Christmas be enough to change Andrew’s mind and encourage him to follow his heart? Jenna Hudson and Kevin Jenner are polar opposites working for the same online publication in New York City. With both having nowhere they want to be for Christmas, they volunteer for a special writing assignment. After a snowstorm forces their plane to land in none other than Santa Claus, Indiana, the two are placed in a Christmas Wonderland and the focus of their story shifts to saving the historic town inn run by Carol and Christopher Winters. As the two overcome their differences, they also rediscover the magic of Christmas. But with the inn's fate in jeopardy and the return of someone from Jenna's past, Carol and Christopher lend a helping hand to bring Jenna and Kevin together. Journalist Elizabeth Lane is one of the country's most famous food writers. In her columns, she describes herself as a hard working farm woman, taking care of her children, and being an excellent cook. But this is all lies. In reality, she is an unmarried New Yorker who can't even boil an egg. The recipes come from her good friend Felix. The owner of the magazine she works for has decided that a heroic sailor will spend his Christmas on *her* farm. Miss Lane knows that her career is over if the truth comes out, but what can she do? Captain Grace Garland, a decorated U.S. veteran, returns home after two tours of Search and Rescue in Afghanistan. After being separated from her beloved K9 partner, Grace must rediscover the magic of Christmas. When she finds herself stranded in the town of River’s Crossing a couple weeks before Christmas, the local judge, Joe Peterson, offers her a place to stay on his property and takes it upon himself to show Grace everything she has been missing; Christmas, family, community, and love. Aunt Sally's Christmas Cookie Company is sold to a large conglomerate and executive Hannah must seal the deal and shut down the factory, which is the small town of Cookie Jar's lifeblood. What was supposed to be a simple assignment for Hannah becomes complicated when she meets Jake, the factory owner who's determined to keep the factory in town. Despite not being a fan of the holiday, the Christmas spirit in this small town is infectious and she gets swept up in the joy of the season while also falling in love with Jake. A young working girl with a blue-collar background is surprised when her new fiancé announces he is actually a prince of a small sovereign country in Europe. After the couple quickly takes off to spend the holidays at his family’s sprawling, royal castle, she must work hard to win over her disapproving and unaccepting future mother-in-law—the Queen—and find out if love truly can conquer all. MARTHA EVANS has been abandoned by her ne'er-do-well husband, who took all their cash and left her homeless and virtually destitute with her two daughters and stepson. Martha leaves town in hopes of finding a job and a place to stay, she finally finds a job at a sleepy rural diner, formerly famous for its home-made root beer. But with her car broken down and the bills piling up, it looks like it's going to be a bleak Christmas for the Evans family. However, there are warm hearts working behind the scenes that ultimately make this the happiest holiday of Martha's life -- a real answer to her prayers Set in the remote Scottish town of Fort William on Christmas Eve, when life is turned upside down for Jen and Rob. Suddenly finding themselves heartbroken, single and stranded, they team up to try and reach home 100 miles away to be with their families. \"Borrowing\" Jen’s now ex-boyfriend’s classic car, the pair hit the road, but it’s not long before the weather turns for the worse forcing them to continue their journey on foot. In this holiday romantic comedy, a mysterious woman who works at the post office answering Santa's mail captures the heart of a disillusioned postal carrier In an effort to get away from their problems for a little while during a particularly stressful holiday season, identical twins, Sophia, a single girl in the city with a demanding boss, and Kaelynn, a single mother of two in the Midwest, decide to switch places for Christmas. A brokenhearted New York painter, Ava, and a West Coast widower, Mason, have their lives collide when Mason’s young daughter, Mia, rents out his guest house to Ava for Christmas, without her dad's knowledge, in an attempt to convince her dad she is responsible enough to earn a dog for Christmas. Two single parents stumble into the possibility of love for Christmas, only to discover that their daughters are embroiled in a nasty rivalry at school. When the rivalry gets out of control, can hope and healing lead everyone to a peaceful and merry Christmas? An independent-minded American tour guide is fired from her job in Rome just before Christmas. She crosses paths with an American executive named Oliver, who wants to buy a high-end Italian ceramics company. Oliver hires Angela to be his tour guide around the Eternal City, as the owner of the ceramics company won’t sell it to him until he learns “the heart and soul of Rome.” But is there another heart and soul that he may win? Kristin has just had to close her small Manhattan clothing boutique to return to her Ohio home town and live in her parents' former home. It's an adjustment for Kristin and her young daughter— especially when she runs into her former high school rival. Kristen and Emily struggle to find their new normal with the help of the hunky local music teacher. Fred is cast as Ebenezer Scrooge in a stage adaption of the classic Christmas story, but is acting a bit stingy in real life. Urban fairytale set in Manchester. A series of tragic events that blight a young boy's life are reversed one Christmas Eve, giving him and those around him the happy ending that they were destined to have. A TV movie special that compiles of a few Looney Tunes episodes centered around an episode of a Christmas Carol, with the part of Scrooge played by Yosemite Sam. Dowdy Sylvia accepts her boss' marriage proposal, even though he only asked her to avoid marriage to another woman. As a wealthy wife, Sylvia changes from ugly duckling to uninhibited swan and even contemplates having an affair with a man she meets during a trip to Paris. After seeing a beautiful dress in the window, Minnie dreams of herself in Paris, France where she is a popular fashionista on her way to her next runway, where she struts down wearing the dress from the window. After she wakes from her dream, Mickey arrives and has revealed to have bought the dress as a gift for Minnie, much to her absolute delight. The owners of the Loon Bay Lodge in St. Stephen, New Brunswick, Canada usually plan fishing and rafting trips for their guests. In this short they take such a trip themselves down the St. Croix River, which forms the southern end of the international boundary between New Brunswick and the state of Maine. Join Emmy Award-winner Julianne Hough and multi-platinum recording artist and television personality, Nick Lachey as they host the magical two-hour event from the Walt Disney World Resort and Disneyland Resort. They join co-host, Jesse Palmer to kick off the holiday season in a way only Disney can, showcasing incredible music performances, special appearances and some unforgettable Disney magic moments including an extraordinary castle lighting spectacular. When a turn-of-century confidence trickster poses as a famous French chanteuse to avoid arrest, she manages to expose the crooked police chief and smooth the path for the reform mayoral candidate. A man released from prison is torn between a life of crime and a fresh start with a woman he meets while scoping out a potential heist. \"Meeting cute\" while Jodie's son Timmy enthuses over a model train set, Jodie and the raffish but likeable Steve immediately hit it off, but she is already engaged to conservative lawyer Paul Davis. The days between Christmas and New Year's Eve, Jodie finds herself in the unenviable position of choosing between two men whom she adores equally--a job not made easier by the well-meaning interference of son Timmy. Pat O'Brien makes the casual acquaintance of fellow American Ruth Warrick while on vacation in Mexico City. What Warrick doesn't know is that O'Brien is a treasury agent, out to get expatriate counterfeiters Alan Hale and Edgar Buchanan. What O'Brien doesn't know is that Warrick is also out to get Hale, whom she holds responsible for her father's death. No overview provided. LeAnn Rimes plays herself from her childhood in Nashville to her performing around the country as a country-western singer, until she has to make a choice: Does she perform at the Grand Ole Opry, following her dreams? Or does she not go to the concert, and stay at her dying grandmother's bedside? The made-for-tv film is based in part on LeAnn's autobiographical novel. Soft-core farce about a vacationing British Lord who, due to the butler's mistake, ends up with three hookers on his hands. A professor bets one of his colleagues that he can turn the stooges into gentlemen within 60 days. With the aid of his pretty daughter, the professor tries to teach the boys proper etiquette. After many frustrating attempts, he introduces the stooges into society at a fancy party. At first things go all right, but the party soon degenerates into a wild pie fight. In 2003 and 2004, a group of the WWE's brightest stars and biggest personalities traveled to Iraq with Vince McMahon in order to entertain American servicemen and women, with memorable results. This action-packed patriotic program features Eddie Guerrero, Chris Benoit, Big Show, Stone Cold Steve Austin, Sable, Dawn Marie, Undertaker, Hardcore Holly, Rey Mysterio, Mick Foley, and many others. Toopy And Binoo: Santa Toopy / Max and Ruby: Max's Christmas / Franklin: Franklin's Magic Christmas / Toopy and Binoo: Snowflakes / Max and Ruby: Ruby's Figure Eight / Franklin: Franklin's Christmas Gift / Rolie Polie Olie: Starry Starry Night / Rolie Polie Olie: Snowie /Miss Spider: Dashing Through the Snow In Idaho, an estranged couple are trapped in a blizzard while on vacation just before Christmas. To the tune of The Nutcracker, a number of elves do all the work in a shoe shop. This year Disney Channel is helping kids around the world get into the holiday spirit with a new special and we have all the details on how you can watch the Disney Channel Holiday House Party on TV or online.  The Disney Channel Holiday House Party is a new holiday-themed sketch comedy show that will feature all of your favorite Disney Channel stars participating remotely from their homes. The special will be hosted by Miranda May from the Disney Channel original series Bunk'd and will star Raphael Alejandro, Suzi Barrett, Issac Ryan Brown, Kylie Cantrall, Scarlett Estevez, Kaylin Hayman, Ramon Reed, Trevor Tordjman, Ruby Rose Turner and Tobie Windham. Royalty in name and mind only, the Royal family led by patriarch Leighton and matriarch Alfreda, kick-off the first film, Royal Family Thanksgiving, with a fake break-up ruse to lure their overly-busy children home for Thanksgiving. Surprises and challenges ensue, including drama with Alfreda's envious sister Mona Levi; the revelation of a deep, dark family secret involving Alfreda's former acquaintance Chivonne Price; and dealings with Leighton's super-loud, outspoken cousin Nelson Royal. Unfortunately, Leighton and Alfreda both play their roles too well as old wounds are re-opened and their carefully planned reunion leads to chaos - and a potentially real break-up. Ten boys and a dog are shipwrecked on an island in the Pacific. After a storm they discover another boat has been shipwrecked on the island. They make friends with two of the survivors, a nurse and ship's carpenter, but discover there are three other survivors who are ruthless mutineers. ROMANZA brings the most famous love stories of the world: stories from the ancient times, the Middle Ages and in the present. Exclusively for Holiday on Ice Singer Chris de Burgh recorded a new version of his hit “The Lady in Red”.  Natalie Morgan is an author and host of a popular podcast, Holiday Love, which shares true stories of holiday romance with its listeners. While to the outside world and her listeners everywhere see Natalie is an expert on romance, she's never truly experienced a romance of her own. As Natalie prepares to embark on a promotional tour for her new book, she stops back home to spend Christmas with her family and to celebrate her parent's 50th anniversary where she unexpectedly begins to experience her own holiday romance as sparks ignite with local firefighter, Jack. A TV movie special that compiles of a few Looney Tunes episodes centered around an episode of a Christmas Carol, with the part of Scrooge played by Yosemite Sam. Candace, daughter of lifestyle mogul Liz Livingstone, has never lived up to her mother’s standards. When a young girl posts a video begging Liz to help arrange a special Christmas party, Candace is sent in her place. As she struggles to prove herself worthy of running the company, Candace meets—and begins falling for—the girl’s uncle, a reporter writing an expose on her. In this adaptation of Charles Dickens' A Christmas Carol, Daffy Duck is the greedy proprietor of the Lucky Duck Mega-Mart and all he can think about is the money to be made during the holiday season. When Marla's dog runs away on Christmas Eve, she must team up with her ex-boyfriend Max to find him. As the pup leads the exes on an all-day-and-night search through their North Carolina hometown, they revisit people, places and things that remind them of the Christmas pasts they spent together. Tom Jacobs is Mr Christmas! He's built an entire business around helping clients find the perfect gift. But what happens when he falls for one lucky recipient? Forced to take the intercontinental trip to Los Angeles by train, and determined to chronicle his adventure, disillusioned journalist Tom Langdon finds himself westbound with a variety of characters. While all passengers on the Christmas train appear to be headed for the same destination, Tom has no idea that the rugged locomotives taking him across America will instead detour straight into his heart. A harsh TV personality, Jennifer, needs a break from her own life, so she hops into a car and drives to a small town mountain retreat. On her way there a blizzard veers off the road and she crashes. When she comes to she has complete amnesia and a friendly passerby takes her in. As time passes she still doesn’t remember who she is and the friendly passerby, a widower himself with three kids, assimilates her into his family. But as she slowly starts remembering who she is, she prefers the new life she’s built in the small town. An ordinary young boy called Nikolas sets out on an extraordinary adventure into the snowy north in search of his father who is on a quest to discover the fabled village of the elves, Elfhelm. Taking with him a headstrong reindeer called Blitzen and a loyal pet mouse, Nikolas soon meets his destiny in this magical and endearing story that proves nothing is impossible… Having just moved back to her hometown without her serviceman husband but with her young son, Gretchen Daniels finds her life in disarray as Christmas approaches. But she discovers new purpose when she helps to deliver a message to her neighbor, Melissa, which makes her an ally in the quest to find the neighbor's sibling she never knew she had. The women become bonded not only by the search, but by the understanding that being there for each other means they're no longer alone. This friendship becomes the greatest Christmas gift of their lives. Based on a bestselling novel by Donna VanLiere. While still mourning the loss of her husband and daughter, recently widowed Ellie King visits her brother Aaron Davis and his children for Christmas. Ellie does her best to enjoy the holidays, even making new friends with Mrs. Thompson, a local shop keeper, and handsome admirer Deputy Strode. Settling in nicely with her brother's family, Ellie also meets Erik, a young man abandoned by his outlaw father whom Aaron has taken in as one of his own. When Aaron travels out of town to purchase adjacent land for farming, Ellie agrees to watch his children, but the season’s festivities are threatened when Aaron goes missing. While the Flintstones and the Rubbles are waiting for Pebbles, Bamm-Bamm and the twins to begin the holiday festivities, they end up tring to teach a homeless boy about values. Sally Brown, a successful children's book author and Army widow loses her late husband's German Shepherd, Buddy, only to later find him adopted by a new family - single father Mark Green and his teenage daughter Emma. Each finds a sense of Christmas spirit as they struggle to decide with whom the dog really belongs. Lucy Mortimer, a successful attorney who returns with her mum to their old Christmas getaway - the Winterleigh Resort - which is on the brink of closing down for good. Much to her surprise, Lucy is reunited with her childhood Christmas dance partner Barrett Brewster and the pair give the resort a new lease of life as the passion between them heats up. Emily (Sarah Paulson) and Ben (Eric Mabius) find their plans to marry on Christmas day coming apart at the seams when Ben is left to plan the wedding details after Emily is forced to go on a business trip. Though Emily, a perfectionist, is determined to have a fairytale wedding, she realizes that love is all that really matters when a freak storm threatens to keep her from making it home in time for the big day. An arborist helps a fourth generation Christmas tree farmer whose evergreens are dying just before the holiday. As she tries to get to the root of the problem before the town tree lighting, they begin to fall in love. Interim school superintendent Eve Morgan finds herself in a tough spot when she is assigned to shut down a school's failing music program and must come to terms with here musical past. While her life is falling apart, single mother Christine finds a magical family heirloom that leads to love and good fortune during Christmas. When Ashley Seever returns home for the holidays hoping to reconnect with her high school sweetheart Grant, she soon meets his new girlfriend. In an attempt to escape the embarrassment, she and her best friend Liam fake their own holiday romance…but when her fake feelings for Liam start to turn real, Ashley will have to choose what her heart really wants this Christmas. Eric Randall, an author of bachelor lifestyle books, is left in charge of his young niece and nephew for the holidays. Eric turns to his neighbor April, a lover of all things Christmas, for help. In order to lighten up her uptight family, the free-spirited daughter of a conservative politician brings weed-infused salad dressing to their Christmas Eve dinner. Chaos ensues when everyone gets unknowingly high, revealing the family's innermost secrets. In the final act of a slasher film, Bruce attempts to reclaim his manliness and impress the final girl by finishing off the killer. Ai-chan goes to 'Kids World' an English daycare center to do; play, arts & crafts, story-time, & lunch. Then she cooks a 4-course meal. The writings of Franz Kafka inspire a weekend getaway filled with sex, drugs and violence. On the day the filmmaker’s grandfather died, his grandmother was the only person to whom he wanted to speak. When he called her that evening to see how she was doing, she immediately turned the question on him. “Holding a lot back,” he said “I’m doing okay. It’s just been a hard day,” to which his grandmother replied “A hard day because of school or a hard day because Bob died?” The film explores the loss of love and its impact on how descendants of that first couple experience it. The overlong but absorbing MGM \"B\" melodrama Mad Holiday stars Edmund Lowe as vacationing movie idol Philip Trent. Tired of starring in murder mysteries, Trent discovers he can't escape typecasting even on an ocean voyage: one of the passengers is murdered in our hero's cabin. The killing is tied in with a stolen diamond and a seemingly unending supply of suspects. To avoid being arrested himself, Trent teams up with pretty detective novelist \"Peter\" Dean (Elissa Landi) to solve the mystery. As Trent's wisecracking press agent Mert Morgan, Ted Healey has a wonderful moment when he stumbles over a corpse and asks nonchalantly, \"What's the matter with him, he crocked?\" Downtrodden office worker Samuel loses his job and, in a freak accident, his overbearing wife Tanita on the same day. To help him recover, his precocious gay best friend, Jessie, accompanies him on a trip to London. Before long, the hapless duo finds themselves in serious trouble with the Punjabi Mafia, Interpol, and inappropriate couplings. In this stop-motion animated holiday short, the Predator tangles with his most formidable foes yet – Santa and his reindeer. Come in from the cold &amp; experience the warmth &amp; comfort of a fireplace on your very own tv. This lets you enjoy a crackling fire without the hassle of smoke or soot. Includes 10 holiday carols. 18-year-old friends Todd and Towzer set off by motorbike to spend a Bank Holiday weekend in Scarborough. Their long hair, cut-off denim jackets, medals, badges and swastikas lead to hostility from everyone they meet, including the police Andy Clyde trying to wear the pants in the family. Vagrant Holiday is a side project done purely for fun.\r No profits made and no interest in making them.\r Don't care about view counts.\r No release schedule.\r Go outside. Create a warm, high definition, holiday atmosphere in your home with the sights and sounds of Christmas. Buck's friend Sheriff Simpson is after the Juarez Kid. Buck knows the Kid and the Sheriff's description does not fit. Buck then meets a one time outlaw who is now the Sheriff's deputy and thinks he is posing as the Kid. When a rancher is killed by the supposed Kid, Buck has a plan utilizing the real Juarez's Kid's ranch that will trap him. No description When a man and woman of modest means meet on a Brighton pier they begin a holiday romance. However, when they each act rich to dupe the other, there are unintended consequences,,, A young executive is trying to convince an airline to sponsor a travel show on television, but he's not getting anywhere. When he tells his fiancé that he may have to postpone their honeymoon, she goes off on him, and as he backs away from her he hits his head on a fire extinguisher and knocks himself out. While unconscious he dreams his own version of the show he's trying so hard to sell. A young model is set up with her own fashion business by a crooked financier, who sells worthless bonds. Judy, Joey and Josh are left for a night at a guest house run by Mrs. Ada Witty. Her nephews are anxious to obtain the house and decide to scare her out by pretending to be ghosts. But when Alice the Chimp goes to investigate, it is the villains who get a scare. STUDENTS FROLIC ON THE BEACH TO UNWIND AFTER ALMOST A YEAR OF SCHOOLING, SIGNALING THE ADVENT OF THE GRAND VACATION."